[
    {
        "image": "LIFEV2",
        "imageAlt": "Lifepoint V2",
        "heading": "Lifepoint V2",
        "site": "https://limitless-sea-16220.herokuapp.com/",
        "content": "Life point is an all in one source for reminders, mood and habit tracking, a daily journal, and an affirmation generator to keep us mindful of the bright side of life. A full stack application that is member driven using sequelize and mysql for database management, middleware to communicate and manage data and models for objects to connect or create tables. Dependencies used are React, Radium, Animate.CSS, React-Bootstrap, Javascript, Bcryptjs, Express, Passport, Mongo DB, RC Year  Calendar, Record RTC.",
        "github": "https://github.com/jerseyjackpot/life-point-v2"
    },
    {
        "image": "ARTGAL",
        "imageAlt": "Virtual Art Gallery",
        "heading": "Virtual Art Gallery",
        "site": "https://nlamonaco86.github.io/Virtual_Art_Gallery/",
        "content": "Virtual Art Gallery is an interactive site that enables a user to create a saved list of all the art they enjoy from Magic the Gathering cards. After creating your art collection, you are matched with a humorous giphy that is interrelated to your card art. Users can then save or share their collection using the dropbox button. The application we built utilized HTML, the Materialize framework, and CSS stylesheets coupled with Javascript and Jquery functionality. The API’s we used for the project were Scryfall (API for Magic Cards), GIPHY (for random GIFs and Images) and Dropbox (for direct download).",
        "github": "https://github.com/jerseyjackpot/Virtual_Art_Gallery"
    },
    {
        "image": "LifePT",
        "imageAlt": "Life-Point",
        "heading": "Life Point",
        "site": "https://life-point.herokuapp.com",
        "content": "Life point is an all in one source for reminders, mood and habit tracking, a daily journal, and an affirmation generator to keep us mindful of the bright side of life. A full stack application that is member driven using sequelize and mysql for database management, middleware to communicate and manage data and models for objects to connect or create tables. Other dependencies used are Express, Express Handlebars, Sequelize/My SQL2, Bcrypt, Passport, CalendarJS, and Express-Session.",
        "github": "https://github.com/jerseyjackpot/life-point"
    },
    {
        "image": "EATBURG",
        "imageAlt": "Eat Da Burger",
        "heading": "Eat Da Burger",
        "site": "https://agile-lake-35945.herokuapp.com/",
        "content": "Eat Da Burger is a javascript page deployed on heroku that utilizes handlebars to display database information on the HTML page. The list of existing burgers can be edited or you can add to the log of either burgers devoured or burgers to be eaten.",
        "github": "https://github.com/jerseyjackpot/Eat-Da-Burger"
    },{
        "image": "DayPlan",
        "imageAlt": "Day Planner",
        "heading": "Day Planner",
        "site": "https://jerseyjackpot.github.io/Day-Planner/",
        "content": "Created a simple calendar application that allows the user to save events for each hour of the day. This app features dynamically updated HTML and CSS powered by jQuery. The page uses the Moment.js library to work with date and time.",
        "github": "https://jerseyjackpot.github.io/Day-Planner/"
    },
    {
        "image": "ASQUIZ",
        "imageAlt": "Astronomy Quiz",
        "heading": "Astronomy Quiz",
        "site": "https://jerseyjackpot.github.io/Code-Quiz/",
        "content": "Astronomy Quiz is a timed javascript game that asks a round of dynamically rendered questions. When the quiz ends you are advised to enter your initials. This will post your score to the high score page with is saved on the client side.",
        "github": "https://github.com/jerseyjackpot/Code-Quiz"
    },{
        "image": "WEATDASH",
        "imageAlt": "Weather Dashboard",
        "heading": "Weather Dashboard",
        "site": "https://jerseyjackpot.github.io/weather-dashboard/",
        "content": "Weather Dashboard is a javascript page that utilizes the OpenWeather API to retrieve weather data for cities. The weather information is generated by dynamically updated HTML and CSS, and features a color-coded UV Index. The cities that are searched also generate a previously searched list that is saved locally and can be cleared with the click of a button",
        "github": "https://github.com/jerseyjackpot/weather-dashboard"
    }
]